app/controllers/polls_controller.rb

  def index
    @polls = Poll.all
---
SELECT "polls".* FROM "polls"

  def create
    @poll = Poll.new(poll_params)
    @poll.param_answers = params[:text_answers]

    respond_to do |format|
      if @poll.save && @poll.save_text_answers
---
INSERT INTO "polls" ("question", "created_at", "updated_at") VALUES (?, ?, ?)  [["question", "What class should I play?"], ["created_at", "2015-02-28 06:39:40.521520"], ["updated_at", "2015-02-28 06:39:40.521520"]]

    def set_poll
      @poll = Poll.find(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]